# StairsWinderpatternFilletInsideCorner Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsWinderpatternFilletInsideCorner Property
ParameterTypeId Class See Also
---
"Fillet on Corner": Fillet on inside corner
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsWinderpatternFilletInsideCorner { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsWinderpatternFilletInsideCorner As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsWinderpatternFilletInsideCorner {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace